
# ZSH is my default shell, but includes others for experimenting
brew "zsh"
brew "bash"
brew "fish"

# Nushell is an interesting shell written in Rust (object oriented)
brew "nushell"

# Neovim is my default text editor
brew "neovim"

# Stow is used for managing dotfiles, and home directory structure
brew "stow"

# OpenSSH is required for SSH
brew "openssh"

# Python package manager, I use a managed ~/.venv for my default install (via `uv`)
brew "uv"

# Includes LLVM and Clang, for C/C++ development as well as compiler development
brew "llvm"

# C/C++ build tools, used for building software
brew "cmake"
brew "ninja"
brew "meson"

# cool CLI utilities: https://joeyh.name/code/moreutils/
brew "moreutils"

# other common CLI utilities
brew "jq"
brew "less"
brew "ripgrep"
brew "git"
brew "git-delta"
brew "fastfetch"
brew "ncdu"
brew "git"
brew "wget"
brew "curl"
brew "fetch"

# math libraries
brew "fftw"

# LLVM v20 is required for llvmlite (Python package)
# brew "llvm@20"
brew "zstd"
brew "ffmpeg"

# image editing software
cask "gimp"
cask "inkscape"

cask "blender"
cask "obs"
cask "vlc"
brew "mpv"
cask "elmedia-player"
cask "alfred"

# TODO: docker?

# Rust programming language
brew "rustup", postinstall: "${HOMEBREW_PREFIX}/bin/rustup default stable"

# text-based web browser
brew "lynx"

# cool command
brew "bat"
brew "bat-extras"

