
# ZSH is my default shell
brew "zsh"

# text editors
# brew "vim"
brew "neovim"

# cool CLI utilities: https://joeyh.name/code/moreutils/
brew "moreutils"

# other common CLI utilities
brew "jq"
brew "less"
brew "ripgrep"
brew "git"
brew "git-delta"
brew "fastfetch"
brew "ncdu"
brew "stow"
brew "git"

# math libraries
brew "fftw"

# OpenSSH is required for SSH
brew "openssh"

# Python package manager
brew "uv"

# C/C++ build tools
brew "cmake"
brew "ninja"
brew "llvm"

# LLVM v20 is required for llvmlite (Python package)
# brew "llvm@20"
brew "zstd"
brew "ffmpeg"

# image editing software
cask "gimp"
cask "inkscape"

# TODO: docker?

# Rust programming language
brew "rustup", postinstall: "${HOMEBREW_PREFIX}/bin/rustup default stable"

# text-based web browser
brew "lynx"

# cool command
brew "bat"
brew "bat-extras"

