
# ZSH is my default shell, but includes others for experimenting
brew "zsh"
brew "bash"
brew "fish"

# Nushell is an interesting shell written in Rust (object oriented)
brew "nushell"

# Neovim is my default text editor
brew "neovim"

# Stow is used for managing dotfiles, and home directory structure
brew "stow"

# OpenSSH is required for SSH
brew "openssh"

# Tmux for managing multiple terminal sessions
brew "tmux"

# Python package manager, I use a managed ~/.venv for my default install (via `uv`)
brew "uv"

# Includes LLVM and Clang, for C/C++ development as well as compiler development
brew "llvm"

# C/C++ build tools, used for building software
brew "cmake"
brew "ninja"
brew "meson"

# cool CLI utilities: https://joeyh.name/code/moreutils/
brew "moreutils"

# other common CLI utilities
brew "jq"
brew "less"
brew "ripgrep"
brew "git"
brew "git-delta"
brew "fastfetch"
brew "ncdu"
brew "git"
brew "wget"
brew "curl"
brew "fetch"
brew "tree"

# count lines of code
brew "cloc"

# readline wrapper, for interactive tools that don't support readline
brew "rlwrap"

# fuzzy finder
brew "fzf"

# system monitoring tools
brew "glances"
brew "bottom"
brew "btop"
brew "htop"

# GitHub CLI for managing GitHub repositories
brew "gh"

# math libraries
brew "fftw"

# LLVM v20 is required for llvmlite (Python package)
# brew "llvm@20"
brew "zstd"
brew "ffmpeg"

# for Java...
brew "openjdk"

# mpv for video playback
brew "mpv"

# Docker for containerization
brew "docker"

# QEMU for running virtual machines
brew "qemu"

# UTM for running virtual machines (QEMU wrapper UI)
cask "utm"

# ImageMagick for image processing
brew "imagemagick"

# image editing software
cask "gimp"
cask "inkscape"

# web browser
cask "firefox"

# LaTeX for MacOS
cask "mactex"

# LibreOffice for MacOS
cask "libreoffice"

# Spotify for audio streaming
cask "spotify"

# Font: JetBrains Mono
cask "font-jetbrains-mono"

# iTerm2 for terminal
cask "iterm2"

# Warp for terminal
cask "warp"

# Ghostty for terminal
cask "ghostty"

# Tabby for terminal
cask "tabby"

# Discord for messaging
#cask "discord"

# Slack for messaging
#cask "slack"

# best archive manager, hands down
cask "the-unarchiver"

# Blender for 3D modeling
cask "blender"

# OBS for video recording
cask "obs"

# VLC for video playback
cask "vlc"

# .NET SDK for .NET development (C#/F#/...)
cask "dotnet-sdk"

# Alfred for productivity
cask "alfred"

cask "elmedia-player"

# Steam for gaming
cask "steam"

# Prism Launcher for Minecraft
cask "prismlauncher"

# Rust programming language
brew "rustup", postinstall: "${HOMEBREW_PREFIX}/bin/rustup default nightly"

# text-based web browser
brew "lynx"

# cool command
brew "bat"
brew "bat-extras"

